<template>
	<view class="page relative">
		<view class="padding-10" style="width: 100%;height: 100%">
			<scroll-view scroll-y style="height: calc(100vh - 20rpx - 90rpx);">
				<view v-html="content"></view>
			</scroll-view>
		</view>
		<view class="fixed flex justify-between align-center padding-20 bg-blue" style="bottom: 0;width: 100vw;">
			<view class="padding-10">上一章</view>
			<view class="padding-10">下一章</view>
		</view>
	</view>
</template>

<script>
	export default{
		data(){
			return {
				title:'',
				content:`
					稀土掘金
					首页
					沸点
					课程上新
					直播
					活动
					竞赛码上报名
					商城
					APP
					邀请有礼
					插件
					
					探索稀土掘金
					搜索
					创作者中心
					首次成功发布 400 字以上文章
					
					
					
					vip
					会员
					8
					菜鸟xiaodu的头像
					网易前端面试（灵犀部门）
					
					捌玖ki
					lv-4
					
					2022年04月17日 13:11 ·  阅读 42718
					更多面试记录，查看我的专栏--面试记录
					
					往期内容：
					
					字节前端面试（广告部门）
					字节pico前端面试
					高途前端面试
					一面
					时间：20220214
					状态：未知（估计不过吧）
					灵犀部门从网上查到的资料业务主要是协同办公
					
					自我介绍
					TS部分
					虽然，我简历上写了typescript，但是前面面之中都没有遇到问我ts的，所以前面复习的也差不多忘了
					typescript基础使用
					typesctipt面试题
					
					ts在项目中如何运用的
					省略
					
					type 和 interface的区别
					type类型别名，可以定义基础类型，元组等
					type不会创建一个真正的新的类名
					类型别名无法被实现implements，而接口可以被派生类实现
					类型别名重名会抛出错误，接口重名是会产生合并 type与interface的区别
					enum常规枚举和常量枚举的区别
					常量枚举在编译以后不会产生一个枚举对象
					常规枚举和常量枚举的区别
					
					void定义的变量类型
					void：没有任何类型。例如：一个函数没有返回值，那么返回值可以定义为void。
					
					vue
					watch和computed的区分
					watch
					
					作用监听数据的变化，支持监听普通数据类型和引用数据类型（如果需要监听对象属性变化，需要搭配deep:true使用），也只是监听对象某个属性的变化。
					不支持缓存，当数据变化时，会出发watch中的内容
					computed
					
					作用根据一些数据计算成一个新的值，支持缓存，依赖的值不发生变化，对其取值时计算属性方法不会重复执行
					不支持异步，当computed内有异步操作时无效，无法监听数据的变化
					http相关的知识
					HTTP/0.9 - 单行协议
					HTTP于1990年问世，那时候HTTP非常简单：只支持GET方法；没有首部；只能获取纯文本。
					
					HTTP/1.0 - 搭建协议的框架
					1996年，HTTP正式被作为标准公布，版本为HTTP/1.0。1.0版本增加了首部、状态码、权限、缓存、长连接（默认短连接）等规范，可以说搭建了协议的基本框架。
					
					HTTP/1.1 - 进一步完善
					1997年，1.1版本接踵而至。1.1版本的重大改进在于默认长连接；强制客户端提供Host首部；管线化；Cache-Control、ETag等缓存的相关扩展。
					
					HTTP/2.0
					
					http1.1 和 htpp2.0的区别
					HTTP/2 相比 1.0 有哪些重大改进？
					
					项目中从http角度做的优化
					http中最大并发数量
					image.png
					
					webpack 和 gulp的区别
					gulp	webpack
					定位	强调的是规范前端开发的流程	是一个前端模块化方案
					目标	自动化和优化开发工作流，为通用website开发而生	通用模块打包加载器，为移动端大型SPA应用而生
					学习难度	易于学习，易于使用，api总共只有5个方法	有大量新的概念和api，有详尽的官方文档
					使用场景	基于流的作用方式合适多页面应用开发	一切皆模块的特点适合单页面应用开发
					作业方式	对输入（gulp.src）的js，ts，scss，less等资源文件进行打包（bundle）、编译（compile）、压缩、重命名等处理后（guld.dest）到指定目录中去，为了构建而打包	对入口文件（entry）递归解析生成依赖关系图，然后将所有以来打包在一起，在打包之前将所有依赖转译成可打包的js模块，为了打包而构建
					使用方式	常规js开发，编写一些列构建任务（task）	编辑各种JSON配置
					有点	适合多页面开发，易于学习，易于使用，接口优雅	可以打包一切资源，适配各种模块系统
					缺点	在大页面应用方面输出乏力，而且对流行的大页面技术有些难以处理(比如vue但文件组织，使用gulp处理就会很困难，而webpack一个loader就能轻松搞定)	不适合多页应用开发，灵活度高但同时配置很繁琐复杂，"打包一切"这个优点对于HTTP1.1尤其重要，因为所有资源打包在一起能明显减少浏览器访问页面时的请求数量，从而减少应用程序必须等待的时间。但这个有点可能会随着HTTP/2的流行而变得不那么突出，因为HTTP/2的多路复用可以有效解决客服端并行请求的瓶颈问题。
					结论	浏览器多页应用（MPA）首选方案	浏览器单页应用（SPA）首选方案
					详细解答webpack 和 gulp的区别
					
					手写题
					字符串是有括号组成，判断内容是否为有效内容
					
					'()' // true
					‘({})’ // true
					'[()' // false
					'[(])' // false
					复制代码
					方法一: 通过数组的压栈出栈的方式
					
					function brackets(str) {
					    const arr = [];
					    const map = {
					        '{': '}',
					        '[': ']',
					        '(': ')'
					    }
					    for(let i = 0, l = str.length; i < l; i++) {
					        let s = str[i];
					        if(map[s]) {
					            arr.push(s);
					        }
					        else if(map[arr.at(-1)] === s) {
					            arr.pop();
					        }
					        
					        // 不满足出栈也不满足出栈时，表示不合法
					        else {
					            return false;
					        }
					    }
					    return arr.length === 0;
					}
					复制代码
					方法二: 字符串中心扩散的方式
					
					function brackets1(str) {
					    const map = {
					        '{': '}',
					        '[': ']',
					        '(': ')'
					    }
					    let tempStr = str;
					    for(let i = 0; i < tempStr.length;) {
					        let s = tempStr[i];
					        let next = tempStr[i + 1];
					        if(map[s] === next) {
					            tempStr = tempStr.slice(0, i) + tempStr.slice(i + 2);
					            i = i > 0 ? i - 1 : 0;
					        }
					        else {
					            i++;
					        }
					    }
					    return tempStr.length === 0;
					}
					复制代码
					分类：
					前端
					标签：
					面试
					JavaScript
					文章被收录于专栏：
					cover
					面试记录
					金三银四，又到面试换工作的时候。 三年的搬砖经验（可菜可菜那种），本科非计算机专业，现在在北京某大厂工作
					关注专栏
					安装掘金浏览器插件
					多内容聚合浏览、多引擎快捷搜索、多工具便捷提效、多模式随心畅享，你想要的，这里都有！
					前往安装
					相关小册
					「微信小程序底层框架实现原理」封面
					VIP 微信小程序底层框架实现原理
					夜还不够黑丶
					lv-5
					1726购买
					¥29.9
					「基于 Stencil 构建 Web Components 组件库」封面
					VIP 基于 Stencil 构建 Web Components 组件库
					Super_x
					lv-2
					
					760购买
					¥29.9
					评论
					
					全部评论 45
					最新
					最热
					Caleb的头像
					Caleb
					lv-2
					掘友等级
					2月前
					讲的很不错[赞]
					VeryCool的头像
					VeryCool
					lv-3
					掘友等级
					前端开发 @ 自成一派
					2月前
					几年经验
					Caleb的头像
					Caleb
					lv-2
					掘友等级
					3月前
					写得真好啊
					
					捌玖ki
					
					（作者）
					3月前
					我觉得你在说反话[奸笑][奸笑][奸笑][奸笑]
					小话唠的头像
					小话唠
					lv-2
					掘友等级
					
					前端小渣渣
					4月前
					求带，算法题刷了忘[流泪]
					
					捌玖ki
					
					（作者）
					4月前
					平时多积累，不要临时抱佛脚
					xspeng的头像
					xspeng
					掘友等级
					前端工程师
					5月前
					手写题用正则写
					鑫鑫向荣的头像
					鑫鑫向荣
					lv-2
					掘友等级
					前端工程师
					5月前
					[赞]
					柿子不如橙子的头像
					柿子不如橙子
					lv-4
					掘友等级
					5月前
					感谢，学习了，受益颇多
					
					捌玖ki
					
					（作者）
					5月前
					这么早起来学习，一定会找到不错的工作哟
					原来如此520的头像
					原来如此520
					lv-2
					掘友等级
					前端开发
					6月前
					[看]
					小小小小宝宝的头像
					小小小小宝宝
					掘友等级
					前端开发
					6月前
					这是第几轮面试吖？
					花折亦无情的头像
					花折亦无情
					lv-5
					掘友等级
					6月前
					边洗澡边刷视频，刷到这个的时候正在抹沐浴露，你知道用下巴点赞有多困难吗？
					
					捌玖ki
					
					（作者）
					6月前
					有画面了[奸笑][奸笑][奸笑][奸笑][吃瓜群众][吃瓜群众][吃瓜群众][吃瓜群众]
					奔跑的蜗牛ing的头像
					奔跑的蜗牛ing
					lv-3
					掘友等级
					互联网
					6月前
					就觉得这些问题还是比较简单基础的呀
					
					捌玖ki
					
					（作者）
					6月前
					是的，比较细节一点
					掘金酱的头像
					掘金酱
					lv-6
					掘友等级
					❤首席客服君 @ 掘金
					7月前
					掘金技术社区签约计划正在招募优质作者，掘金酱邀你报名！即日起到7月31日，报名+投稿，不仅可以抽奖AirPods，瓜分2万元奖池，成为签约作者还能写作变现！现金收益、流量扶持、签约认证等你参与～ juejin.cn
					馍馍汉宝的头像
					馍馍汉宝
					掘友等级
					
					7月前
					为什么会问gulp啊[捂脸]
					XZ探长的头像
					XZ探长
					lv-3
					掘友等级
					探索者
					8月前
					短短几题，已窥门径，一个字"卷"
					image
					用户6125274842255的头像
					用户6125274842255
					掘友等级
					8月前
					手写题那个，是回文字符串吧
					𝕒𝕝𝕓𝕚𝕠𝕟的头像
					𝕒𝕝𝕓𝕚𝕠𝕟
					掘友等级
					8月前
					感觉有bug'[(])]' 也是通过的
					
					捌玖ki
					
					（作者）
					8月前
					多谢提醒方法一少了一个判断条件，当 既不满足进栈也不满足出栈时，表示字符串不合法，直接返回false
					等待丶期待的头像
					等待丶期待
					掘友等级
					前端工程师
					9月前
					记得很早之前type可以继承和实现了
					XZ探长的头像
					XZ探长
					lv-3
					掘友等级
					探索者
					9月前
					[赞]推一个前端小程序“前端超市”，没事可以刷刷面试题，看看开发技巧
					image
					
					捌玖ki
					
					（作者）
					9月前
					谢谢
					宗慢慢的头像
					宗慢慢
					lv-1
					掘友等级
					前端开发工程师
					9月前
					括号判断就是回文相关，直接双指针啊
					
					捌玖ki
					
					（作者）
					9月前
					这应该不是回问
					
					()()(){}[]; // true
					({})([]); // true
					罗小秀的头像
					罗小秀
					掘友等级
					前端工程师 @ 潇湘晨报
					9月前
					感觉都不难， 这个岗位是薪资多少的啊
					查看全部 45 条回复
					
					相关推荐
					一只小ice
					5月前
					前端
					JavaScript
					面试
					前端人 不了解的promise/async await
					6.1w
					1114
					129
					宅神king
					3月前
					前端
					面试
					JavaScript
					六年前端面试报告
					8.6w
					1161
					260
					马祎繁
					6月前
					面试
					前端
					JavaScript
					每天10个前端小知识 <Day 7>
					4.8w
					642
					55
					阿里巴巴大淘宝技术
					1年前
					前端
					怎样判断面试者是否有扎实的前端基础？
					6.0w
					1573
					115
					逍丶
					4月前
					前端
					JavaScript
					面试
					2022年我的面试万字总结（JS篇上）
					4.4w
					694
					53
					Sunshine_Lin
					1年前
					前端
					JavaScript
					面试
					史上最全！熬夜整理56个JavaScript高级的手写知识点！！专业扫盲！
					6.0w
					1822
					89
					worlds
					1月前
					前端
					面试
					JavaScript
					2022年终总结——毕业一年，刚背上房贷就被裁
					3.6w
					185
					211
					前端胖头鱼
					1年前
					前端
					JavaScript
					面试
					因为实现不了Promise.all，一场面试凉凉了
					6.5w
					927
					141
					一尾流莺
					1年前
					前端
					面试
					【🐯初/中级前端面经】中小型公司面试时都会问些什么?
					10.8w
					2171
					200
					小张不慌张
					5年前
					Node.js
					JavaScript
					面试
					如何通过饿了么 Node.js 面试
					3.5w
					930
					19
					麻不烧
					6月前
					前端
					面试
					面试官为啥总是喜欢问前端路由实现方式？
					8.5w
					1828
					192
					CUGGZ
					1年前
					面试
					金九银十，你准备好面试了吗? (附30w字前端面试题总结)
					7.0w
					1023
					53
					前端小溪
					5月前
					前端
					面试
					Vue.js
					上海疫情后一个前端的面试心路历程
					6.4w
					1356
					280
					Sunshine_Lin
					1年前
					前端
					JavaScript
					面试
					「干货」今年我写了55篇文章，面试了30个人，学习了385个知识点！
					4.2w
					883
					360
					战场小包
					1年前
					前端
					面试
					JavaScript
					牛客最新前端JS笔试百题
					5.1w
					977
					132
					工边页字
					6月前
					前端
					JavaScript
					面试
					中高级前端工程师都需要熟悉的技能--前端缓存
					4.7w
					1403
					204
					vortesnail
					1年前
					前端
					面试
					做了一份前端面试复习计划，保熟～
					43.3w
					8242
					429
					Sunshine_Lin
					1年前
					前端
					JavaScript
					面试
					7张图，20分钟就能搞定的async/await原理！为什么要拖那么久？
					7.3w
					1773
					128
					掘金安东尼
					7月前
					前端
					JavaScript
					面试
					👨‍💻面试官：工作两年了，这么简单的算法题你都不会？
					6.2w
					456
					122
					杰出D
					1年前
					前端
					算法
					面试了十几个高级前端，竟然连（扁平数据结构转Tree）都写不出来
					26.1w
					3754
					1925
					友情链接：
					
					小程序可视化开发软件
					怎么把下载的网页js格式
					vue项目实战 掘金
					模拟文件件夹效果js
					jsp fmt 秒转化分钟
					js轮廓图代码

				`
			}
		},
		onLoad(option){
			console.log(option);
			this.title = option.title
			uni.setNavigationBarTitle({
				title: option.title
			})

		}
	}
</script>

<style lang="scss">
</style>